# -*- encoding: utf8 -*-

attack_cat = {
    "拒绝服务漏洞": ["拒绝服务", "崩溃"],
    "信息泄露漏洞": ["信息泄露", "数据泄漏"],
    "缓冲区溢出漏洞": ["溢出", "内存", "格式", "空指针","堆栈"],
    "跨站脚本漏洞": ["跨站脚本"],
    "注入漏洞": ["注入"],
    "文件权限漏洞": ["文件包含", "文件读", "下载", "文件访问", "文件权限", "文件破坏", "文件覆盖", "文件操作", "文件插入"],
    "文件上传漏洞": ["上传"],
    "目录遍历漏洞": ["目录遍历", "路径遍历", "路径枚举"],
    "代码执行漏洞": ["代码执行", "执行代码"],
    "命令执行漏洞": ["命令执行"],
    "跨站请求伪造漏洞": ["请求伪造"],
    "授权管理漏洞": ["绕过", "授权", "权限", "信任管理", "凭证保护", "提权", "命令发送", "信任管理"],
    "访问控制漏洞": ["索引资源访问", "访问", "域策略", "控制", "越界"],
    "身份认证漏洞": ["加密", "硬编码", "密码", "暴力破解", "密钥", "私钥","账户", "帐号", "帐户", "身份验证", "弱口令", "凭证", "用户名", "证书"],
    "逻辑漏洞": ["设计错误", "边界漏洞", "竞争条件"],
    "会话管理漏洞": ["劫持", "会话"],
    "重定向漏洞": ["重定向"],
    "重放漏洞": ["重放", "重播"],
    "搜索路径漏洞": ["搜索路径"]

}
